app/views/trains/_form.html.erb

SELECT "railway_stations".* FROM "railway_stations"
---
    <%= f.label :current_station, "Текущая станция:" %><br>
    <%= f.collection_select :current_station_id, RailwayStation.all, :id, :name %>

SELECT "routes".* FROM "routes"
---
    <%= f.label :current_station, "На маршруте:" %><br>
    <%= f.collection_select :route_id, Route.all, :id, :name %>