app/views/trains/_form.html.haml

    %br/
    = f.collection_select :current_station_id, RailwayStation.all, :id, :name
  .field
---
SELECT "railway_stations".* FROM "railway_stations"

    %br/
    = f.collection_select :route_id, Route.all, :id, :name
  .field
---
SELECT "routes".* FROM "routes"