app/views/trains/show.html.erb

  <strong>На маршруте:</strong>
  <% if @train.route.present? %>
---
SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT 1  [["id", 9]]