app/views/trains/show.html.haml

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT 1  [["id", 1]]
---
  %strong На маршруте:
  - if @train.route.present?

SELECT "railcars".* FROM "railcars" WHERE "railcars"."train_id" = ?  ORDER BY "railcars"."number" DESC  [["train_id", 1]]
---
  -if @train.sort_order
    - @train.railcars.order(number: :desc).each do |railcar|

SELECT "railcars".* FROM "railcars" WHERE "railcars"."train_id" IN (1)
---
  -else
    - @train.railcars.each do |railcar|