app/views/economy_railcars/_form.html.haml

SELECT "trains".* FROM "trains"
---
    %br
      = f.collection_select :train_id, Train.all, :id, :number