app/views/coupe_railcars/_form.html.haml

    %br
      = f.collection_select :train_id, Train.all, :id, :number
---
SELECT "trains".* FROM "trains"