app/views/railcars/_form.html.haml

SELECT "railcar_types".* FROM "railcar_types"
---
    %br
      = f.collection_select :railcar_type_id, RailcarType.all, :id, :railcar_type
  .field

SELECT "trains".* FROM "trains"
---
    %br
      = f.collection_select :train_id, Train.all, :id, :number