app/controllers/coupe_railcars_controller.rb

  def update
    if @railcar.update(coupe_railcar_params)
---
UPDATE "railcars" SET "train_id" = ? WHERE "railcars"."id" = ?  [["train_id", 4], ["id", 1]]

  def destroy
    @railcar.destroy
---
DELETE FROM "railcars" WHERE "railcars"."type" IN ('CoupeRailcar') AND "railcars"."id" = ?  [["id", 5]]

  def set_train
    @railcar = CoupeRailcar.find(params[:id])
---
SELECT  "railcars".* FROM "railcars" WHERE "railcars"."type" IN ('CoupeRailcar') AND "railcars"."id" = ? LIMIT 1  [["id", 5]]