app/controllers/economy_railcars_controller.rb

DELETE FROM "railcars" WHERE "railcars"."type" IN ('EconomyRailcar') AND "railcars"."id" = ?  [["id", 6]]
---
  def destroy
    @railcar.destroy

SELECT  "railcars".* FROM "railcars" WHERE "railcars"."type" IN ('EconomyRailcar') AND "railcars"."id" = ? LIMIT 1  [["id", 6]]
---
  def set_train
    @railcar = EconomyRailcar.find(params[:id])