app/controllers/lux_railcars_controller.rb

  def update
    if @railcar.update(lux_railcar_params)
---
UPDATE "railcars" SET "number" = ? WHERE "railcars"."id" = ?  [["number", 244], ["id", 3]]

  def destroy
    @railcar.destroy
---
DELETE FROM "railcars" WHERE "railcars"."type" IN ('LuxRailcar') AND "railcars"."id" = ?  [["id", 2]]

  def set_train
    @railcar = LuxRailcar.find(params[:id])
---
SELECT  "railcars".* FROM "railcars" WHERE "railcars"."type" IN ('LuxRailcar') AND "railcars"."id" = ? LIMIT 1  [["id", 2]]