app/controllers/railcars_controller.rb

  def index
    @railcars = Railcar.all
---
SELECT "railcars".* FROM "railcars"

  def create
    @railcar = Railcar.new(railcar_params)

    if @railcar.save
---
INSERT INTO "railcars" ("number", "upper_seats", "lower_seats", "side_upper_seats", "side_lower_seats", "railcar_type_id", "train_id", "type") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["number", 14], ["upper_seats", 12], ["lower_seats", 123], ["side_upper_seats", 1234], ["side_lower_seats", 12345], ["railcar_type_id", 2], ["train_id", 1], ["type", "EconomyRailcar"]]

  def update
    if @railcar.update(railcar_params)
---
UPDATE "railcars" SET "side_upper_seats" = ?, "side_lower_seats" = ?, "seating_seats" = ? WHERE "railcars"."id" = ?  [["side_upper_seats", 123], ["side_lower_seats", 123], ["seating_seats", 123], ["id", 1]]

  def set_train
    @railcar = Railcar.find(params[:id])
---
SELECT  "railcars".* FROM "railcars" WHERE "railcars"."id" = ? LIMIT 1  [["id", 1]]