app/controllers/routes_controller.rb

SELECT "routes".* FROM "routes"
---
  def index
    @routes = Route.all

INSERT INTO "routes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "aaa"], ["created_at", "2016-06-08 12:02:31.050657"], ["updated_at", "2016-06-08 12:02:31.050657"]]
---
  def create
    @route = Route.new(route_params)

    if @route.save

UPDATE "routes" SET "name" = ?, "updated_at" = ? WHERE "routes"."id" = ?  [["name", "222hgh"], ["updated_at", "2016-06-08 12:32:00.652613"], ["id", 4]]
---
  def update
    if @route.update(route_params)

DELETE FROM "routes" WHERE "routes"."id" = ?  [["id", 3]]
---
  def destroy
    @route.destroy

SELECT  "routes".* FROM "routes" WHERE "routes"."id" = ? LIMIT 1  [["id", 4]]
---
  def set_train
    @route = Route.find(params[:id])