app/controllers/seating_railcars_controller.rb

  def set_train
    @railcar = SeatingRailcar.find(params[:id])
---
SELECT  "railcars".* FROM "railcars" WHERE "railcars"."type" IN ('SeatingRailcar') AND "railcars"."id" = ? LIMIT 1  [["id", 7]]