app/controllers/trains_controller.rb

  def index
    @trains = Train.all
---
SELECT "trains".* FROM "trains"

  def show
    @type_1 = @train.railcars.where(railcar_type: 1)
---
SELECT upper_seat_number FROM "railcars" WHERE "railcars"."train_id" = ? AND "railcars"."railcar_type_id" = 1  [["train_id", 1]]

  def create
    @train = Train.new(train_params)

    respond_to do |format|
      if @train.save
---
INSERT INTO "trains" ("number", "current_station_id", "route_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["number", 1], ["current_station_id", 1], ["route_id", 1], ["created_at", "2016-07-25 08:54:42.723718"], ["updated_at", "2016-07-25 08:54:42.723718"]]

  def update
    respond_to do |format|
      if @train.update(train_params)
---
UPDATE "trains" SET "current_station_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["current_station_id", 2], ["updated_at", "2016-07-07 12:20:34.623238"], ["id", 2]]

    def set_train
      @train = Train.includes(:railcars).find(params[:id])
---
SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT 1  [["id", 1]]
SELECT "railcars".* FROM "railcars" WHERE "railcars"."train_id" IN (3)