app/views/routes/show.html.haml

%p
  -if @route.trains.present?
---
SELECT "trains".* FROM "trains" WHERE "trains"."route_id" = ?  [["route_id", 6]]